fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ВКМ_НачислениеФиксированнойПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеФиксированнойПремии</name>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_СписокСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_СуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>ВКМ_Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВКМ_ПроцентПремии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>ВКМ_Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ВКМ_Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ВКМ_СформироватьДвиженияПоРегистру(
		Движения.ВКМ_ДополнительныеНачисления, ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ВКМ_ФиксированнаяПремия,
		Новый Структура("ВКМ_СуммаПремии", 0));

	ВКМ_СформироватьДвиженияПоРегистру(
		Движения.ВКМ_Удержания, ПланыВидовРасчета.ВКМ_Удержания.ВКМ_НДФЛ, Новый Структура("Процент", 13));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует движения по регистру расчета для фиксированной премии.
//
// Параметры:
//   Регистр - РегистрРасчетаМенеджер - Менеджер записей регистра расчета, в который создаются движения
//   ВидРасчета - ПланВидовРасчетаСсылка - Вид расчета для формируемых движений
//   ПараметрыРасчета - Структура - Параметры расчета, содержащие сумму премии или процент
Процедура ВКМ_СформироватьДвиженияПоРегистру(Регистр, ВидРасчета, ПараметрыРасчета)
	
	Регистр.Записывать = Истина;

	Для Каждого Строка Из ВКМ_СписокСотрудников Цикл

		Если Строка.ВКМ_Сотрудник = Справочники.Пользователи.ПустаяСсылка() Тогда
			Продолжить; // Пропускаем строки с незаполненным сотрудником
		КонецЕсли;
		
		Движение = Регистр.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ВидРасчета;
		Движение.ВКМ_Сотрудник = Строка.ВКМ_Сотрудник;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		
		Если ПараметрыРасчета.Свойство("ВКМ_СуммаПремии") Тогда
			Движение.ВКМ_Результат = Строка.ВКМ_СуммаПремии;
		ИначеЕсли ПараметрыРасчета.Свойство("Процент") Тогда
			Движение.ВКМ_Результат = Строка.ВКМ_СуммаПремии * ПараметрыРасчета.Процент / 100;
		КонецЕсли;

	КонецЦикла;

	Регистр.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
